docs/posts/2008-05-18-millennium-development-goals.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Millennium Development Goals</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Millennium Development Goals</h1>
<p class="subtitle" role="doc-subtitle">May 18, 2008</p>
</header><p>
Yesterday, Mitch Randall, pastor of <a href="http://www.northhavenchurch.net/"> NorthHaven Church</a> in Norman, preached on Christianity and Justice. In his message, he discussed the Millennium Development Goals, seven goals that have been adopted by the world&rsquo;s countries, including the United States. It is legitimate for the church to ask what we can do to help our own nation achieve its stated goals.
</p>

<p>
The eight goals are outlined on the <a href="http://www.un.org/millenniumgoals/index.html"> United Nations Website</a>:
</p>

<ol class="org-ol">
<li>Eradicate extreme poverty and hunger<br></li>
<li>Achieve universal primary education<br></li>
<li>Promote gender equality and empower women<br></li>
<li>Reduce child mortality<br></li>
<li>Improve maternal health<br></li>
<li>Combat HIV/AIDS, marlaria and other diseases<br></li>
<li>Ensure environmental sustainability<br></li>
<li>Develop a global partnership for development</li>
</ol>

<p>
You can read a progress report <a href="http://www.un.org/millenniumgoals/docs/UNSD_MDG_Report_2007e.pdf">here</a>. Each region of the world shows progress in almost every category, but there is still much work to do. These goals should be the goals of the church, for they certainly seem consistent with Jesus&rsquo; stated mission in Luke 4:18-19: “The Spirit of the Lord is upon me, because he has anointed me to bring good news to the poor. He has sent me to proclaim release to the captives and recovery of sight to the blind, to let the oppressed go free, to proclaim the year of the Lord’s favor.”
</p>

<p>
May his mission be our own.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
